[{"title":"AI For Everyone","description":"AI is not only for engineers. If you want your organization to become better at using AI, this is the course to tell everyone--especially your non-technical colleagues--to take. \n\nIn this course, you will learn:\n\n- The meaning behind common AI terminology, including neural networks, machine learning, deep learning, and data science\n- What AI realistically can--and cannot--do\n- How to spot opportunities to apply AI to problems in your own organization\n- What it feels like to build machine learning and data science projects\n- How to work with an AI team and build an AI strategy in your company\n- How to navigate ethical and societal discussions surrounding AI\n\nThough this course is largely non-technical, engineers can also take this course to learn the business aspects of AI.","difficulty_level":"Beginner Level","duration":"Approx. 9 hours to complete","keywords":"Workflow of Machine Learning projects, AI terminology, AI strategy, Workflow of Data Science projects, ","url":"https:\/\/www.coursera.org\/learn\/ai-for-everyone"},{"title":"Technical Support Fundamentals","description":"This course is the first of a series that aims to prepare you for a role as an entry-level IT Support Specialist. In this course, you’ll be introduced to the world of Information Technology, or IT. You’ll learn about the different facets of Information Technology, like computer hardware, the Internet, computer software, troubleshooting, and customer service. This course covers a wide variety of topics in IT that are designed to give you an overview of what’s to come in this certificate program.\n\nBy the end of this course, you’ll be able to:\n● understand how the binary system works.\n● assemble a computer from scratch.\n● choose and install an operating system on a computer.\n● understand what the Internet is, how it works, and the impact it has in the modern world.\n● learn how applications are created and how they work under the hood of a computer.\n● utilize common problem-solving methodologies and soft skills in an Information Technology setting.","difficulty_level":"Beginner Level","duration":"Approx. 20 hours to complete","keywords":"Binary Code, Customer Support, Linux, Troubleshooting, ","url":"https:\/\/www.coursera.org\/learn\/technical-support-fundamentals"},{"title":"SQL for Data Science","description":"As data collection has increased exponentially, so has the need for people skilled at using and interacting with data; to be able to think critically, and provide insights to make better decisions and optimize their businesses. This is a data scientist, “part mathematician, part computer scientist, and part trend spotter” (SAS Institute, Inc.). According to Glassdoor, being a data scientist is the best job in America; with a median base salary of $110,000 and thousands of job openings at a time. The skills necessary to be a good data scientist include being able to retrieve and work with data, and to do that you need to be well versed in SQL, the standard language for communicating with database systems.\n\nThis course is designed to give you a primer in the fundamentals of SQL and working with data so that you can begin analyzing it for data science purposes. You will begin to ask the right questions and come up with good answers to deliver valuable insights for your organization. This course starts with the basics and assumes you do not have any knowledge or skills in SQL. It will build on that foundation and gradually have you write both simple and complex queries to help you select data from tables.  You'll start to work with different types of data like strings and numbers and discuss methods to filter and pare down your results. \n\nYou will create new tables and be able to move data into them. You will learn common operators and how to combine the data. You will use case statements and concepts like data governance and profiling. You will discuss topics on data, and practice using real-world programming assignments. You will interpret the structure, meaning, and relationships in source data and use SQL as a professional to shape your data for targeted analysis purposes. \n\nAlthough we do not have any specific prerequisites or software requirements to take this course, a simple text editor is recommended for the final project. So what are you waiting for? This is your first step in landing a job in the best occupation in the US and soon the world!","difficulty_level":"Beginner Level","duration":"Approx. 20 hours to complete","keywords":"Data Science, Data Analysis, Sqlite, SQL, ","url":"https:\/\/www.coursera.org\/learn\/sql-for-data-science"},{"title":"Digital Transformation","description":"Digital transformation is a hot topic--but what exactly is it and what does it mean for companies? In this course, we talk about digital transformation in two ways. First we discuss the pace of change and the imperative it creates for businesses. Next we provide the context for this transformation and what it takes to win in the digital age. Then we walk through BCG's proprietary framework, which helps you identify key areas to digitize, including strategy, core processes, and technology.\n\nBy the end of this course, you'll be able to:\n--describe the underlying economics of innovation, technology, and market disruptions\n--weigh the pros and cons of current digital technologies driving advancement\n--utilize BCG's digital transformation framework as a \"\"how-to\"\" for digitizing your organization","difficulty_level":"Beginner Level","duration":"Approx. 20 hours to complete","keywords":"Technology Disruption, Digital Trends, Competitive Lifecycle, Digital Strategy, Strategic Management, ","url":"https:\/\/www.coursera.org\/learn\/bcg-uva-darden-digital-transformation"},{"title":"What is Data Science? ","description":"The art of uncovering the insights and trends in data has been around since ancient times. The ancient Egyptians used census data to increase efficiency in tax collection and they accurately predicted the flooding of the Nile river every year. Since then, people working in data science have carved out a unique and distinct field for the work they do. This field is data science. In this course, we will meet some data science practitioners and we will get an overview of what data science is today.\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.","difficulty_level":"Beginner Level","duration":"Approx. 6 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/what-is-datascience"},{"title":"AWS Fundamentals: Going Cloud-Native","description":"This course will introduce you to Amazon Web Services (AWS) core services and infrastructure. Through demonstrations you'll learn how to use and configure AWS services to deploy and host a cloud-native application. \n\nEarly in the course, your AWS instructors will discuss how the AWS cloud infrastructure is built, walk you through Amazon Elastic Compute Cloud (Amazon EC2) and Amazon Lightsail compute services. They'll also introduce you to networking on AWS, including how to set up Amazon Virtual Public Cloud (VPC) and different cloud storage options, including Amazon Elastic Block Storage (EBS), Amazon Simple Storage Service (S3) and Amazon Elastic File Service (EFS). Later in the course you'll learn about AWS Database services, such as Amazon Relational Database Service (RDS) and Amazon DynomoDB. Your instructors will also walk you through how to monitor and scale you application on AWS using Amazon CloudWatch and Amazon EC2 Elastic Load Balancing (ELB) and Auto Scaling. Lastly, you'll learn about security on AWS, as well as how to manage costs when using the AWS cloud platform. \n\nIn this course, you won't be required to complete hands-on exercises, but we strongly suggest you take advantage of the AWS Free Tier to follow along as the instructors demonstrate the AWS services. Class forums will also allow you to ask questions and interact with AWS training instructors. After completing this course, you'll have the basic fundamentals to get started on AWS. \n\nThis course has been developed by AWS, and is delivered by AWS technical instructors who teach cloud computing courses around the globe.","difficulty_level":"Beginner Level","duration":"Approx. 7 hours to complete","keywords":"Cloud Computing Security, AWS cloud, Cloud Storage, cloud networking, Cloud Computing, ","url":"https:\/\/www.coursera.org\/learn\/aws-fundamentals-going-cloud-native"},{"title":"Financial Markets","description":"An overview of the ideas, methods, and institutions that permit human society to manage risks and foster enterprise.  Emphasis on financially-savvy leadership skills. Description of practices today and analysis of prospects for the future. Introduction to risk management and behavioral finance principles to understand the real-world functioning of securities, insurance, and banking industries.  The ultimate goal of this course is using such industries effectively and towards a better society.","difficulty_level":"Beginner Level","duration":"Approx. 38 hours to complete","keywords":"Behavioral Finance, Financial Markets, Finance, Behavioral Economics, ","url":"https:\/\/www.coursera.org\/learn\/financial-markets-global"},{"title":"Digital Product Management: Modern Fundamentals","description":"Not so long ago, the job of product manager was about assessing market data, creating requirements, and managing the hand-off to sales\/marketing. Maybe you’d talk to a customer somewhere in there and they’d tell you what features they wanted. But companies that manage product that way are dying.\n\nBeing a product person today is a new game, and product managers are at the center of it. Today, particularly if your product is mostly digital, you might update it several times a day. Massive troves of data are available for making decisions and, at the same time, deep insights into customer motivation and experience are more important than ever. The job of the modern product manager is to charter a direction and create a successful working environment for all the actors involved in product success.  It’s not a simple job or an easy job, but it is a meaningful job where you’ll be learning all the time. \n\nThis course will help you along your learning journey and prepare you with the skills and perspective you need to:\n\nCreate the actionable focus to successfully manage your product (week 1)\nFocus your work using modern product management methods (week 2)\nManage new products and explore new product ideas (week 3)\nManage and amplify existing products (week 4)\n\nThis course is ideal for current product or general  managers interested in today's modern product management methods.\n\nThis course was developed with the generous support of the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.","difficulty_level":"Beginner Level","duration":"Approx. 19 hours to complete","keywords":"Product\/Market Fit, Product Management, Design Thinking, Innovation Pipeline, Lean Startup, ","url":"https:\/\/www.coursera.org\/learn\/uva-darden-digital-product-management"},{"title":"Design Thinking for Innovation","description":"Today innovation is everyone's business. Whether you are a manager in a global corporation, an entrepreneur starting up, in a government role, or a teacher in an elementary school, everyone is expected to get lean – to do better with less. And that is why we all need design thinking. At every level in every kind of organization, design thinking provides the tools you need to become an innovative thinker and uncover creative opportunities that are there – you're just not seeing them yet.\n\nIn this course, we provide an overview of design thinking and work with a model containing four key questions and several tools to help you understand design thinking as a problem solving approach. We also look at several stories from different organizations that used design thinking to uncover compelling solutions.","difficulty_level":"Beginner Level","duration":"Approx. 10 hours to complete","keywords":"Strategic Thinking, Design Thinking, Innovation Management, Design Management, Innovation, ","url":"https:\/\/www.coursera.org\/learn\/uva-darden-design-thinking-innovation"},{"title":"Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization","description":"This course will teach you the \"magic\" of getting deep learning to work well. Rather than the deep learning process being a black box, you will understand what drives performance, and be able to more systematically get good results. You will also learn TensorFlow. \n\nAfter 3 weeks, you will: \n- Understand industry best-practices for building deep learning applications. \n- Be able to effectively use the common neural network \"tricks\", including initialization, L2 and dropout regularization, Batch normalization, gradient checking, \n- Be able to implement and apply a variety of optimization algorithms, such as mini-batch gradient descent, Momentum, RMSprop and Adam, and check for their convergence. \n- Understand new best-practices for the deep learning era of how to set up train\/dev\/test sets and analyze bias\/variance\n- Be able to implement a neural network in TensorFlow. \n\nThis is the second course of the Deep Learning Specialization.","difficulty_level":"Beginner Level","duration":"Approx. 15 hours to complete","keywords":"Hyperparameter, Tensorflow, Hyperparameter Optimization, Deep Learning, ","url":"https:\/\/www.coursera.org\/learn\/deep-neural-network"},{"title":"Machine Learning","description":"Machine learning is the science of getting computers to act without being explicitly programmed. In the past decade, machine learning has given us self-driving cars, practical speech recognition, effective web search, and a vastly improved understanding of the human genome. Machine learning is so pervasive today that you probably use it dozens of times a day without knowing it. Many researchers also think it is the best way to make progress towards human-level AI. In this class, you will learn about the most effective machine learning techniques, and gain practice implementing them and getting them to work for yourself. More importantly, you'll learn about not only the theoretical underpinnings of learning, but also gain the practical know-how needed to quickly and powerfully apply these techniques to new problems. Finally, you'll learn about some of Silicon Valley's best practices in innovation as it pertains to machine learning and AI.\n\nThis course provides a broad introduction to machine learning, datamining, and statistical pattern recognition. Topics include: (i) Supervised learning (parametric\/non-parametric algorithms, support vector machines, kernels, neural networks). (ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning). (iii) Best practices in machine learning (bias\/variance theory; innovation process in machine learning and AI). The course will also draw from numerous case studies and applications, so that you'll also learn how to apply learning algorithms to building smart robots (perception, control), text understanding (web search, anti-spam), computer vision, medical informatics, audio, database mining, and other areas.","difficulty_level":"","duration":"Approx. 56 hours to complete","keywords":"Logistic Regression, Artificial Neural Network, Machine Learning (ML) Algorithms, Machine Learning, ","url":"https:\/\/www.coursera.org\/learn\/machine-learning"},{"title":"Become a CBRS Certified Professional Installer by Google","description":"Get CPI certified at WISPAPALOOZA! Learn from Google experts and at the end of the training you will be able to take the certification exam on-site. Upon passing, you will receive your CPI credentials and your information will be automatically registered with WInnForum. Return home and be ready to start installing CBRS devices.","difficulty_level":"","duration":"Approx. 7 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/google-cbrs-cpi-training"},{"title":"Programming for Everybody (Getting Started with Python)","description":"This course aims to teach everyone the basics of programming computers using Python. We cover the basics of how one constructs a program from a series of simple instructions in Python.  The course has no pre-requisites and avoids all but the simplest mathematics. Anyone with moderate computer experience should be able to master the materials in this course. This course will cover Chapters 1-5 of the textbook “Python for Everybody”.  Once a student completes this course, they will be ready to take more advanced programming courses. This course covers Python 3.","difficulty_level":"","duration":"Approx. 12 hours to complete","keywords":"Python Syntax And Semantics, Basic Programming Language, Computer Programming, Python Programming, ","url":"https:\/\/www.coursera.org\/learn\/python"},{"title":"The Science of Well-Being","description":"In this course you will engage in a series of challenges designed to increase your own happiness and build more productive habits. As preparation for these tasks, Professor Laurie Santos reveals misconceptions about happiness, annoying features of the mind that lead us to think the way we do, and the research that can help us change. You will ultimately be prepared to successfully incorporate a specific wellness activity into your life.\n\nTHE SCIENCE OF WELL BEING WAS PRODUCED IN PART DUE TO THE GENEROUS FUNDING OF THE DAVID F. SWENSEN FUND FOR INNOVATION IN TEACHING.","difficulty_level":"","duration":"Approx. 20 hours to complete","keywords":"Gratitude, Happiness, Meditation, Savoring, ","url":"https:\/\/www.coursera.org\/learn\/the-science-of-well-being"},{"title":"Python Data Structures","description":"This course will introduce the core data structures of the Python programming language. We will move past the basics of procedural programming and explore how we can use the Python built-in data structures such as lists, dictionaries, and tuples to perform increasingly complex data analysis. This course will cover Chapters 6-10 of the textbook “Python for Everybody”.  This course covers Python 3.","difficulty_level":"","duration":"Approx. 11 hours to complete","keywords":"Python Syntax And Semantics, Data Structure, Tuple, Python Programming, ","url":"https:\/\/www.coursera.org\/learn\/python-data"},{"title":"Learning How to Learn: Powerful mental tools to help you master tough subjects","description":"This course gives you easy access to the invaluable learning techniques used by experts in art, music, literature, math, science, sports, and many other disciplines. We’ll learn about the how the brain uses two very different learning modes and how it encapsulates (“chunks”) information. We’ll also cover illusions of learning, memory techniques, dealing with procrastination, and best practices shown by research to be most effective in helping you master tough subjects.  \n\nUsing these approaches, no matter what your skill levels in topics you would like to master, you can change your thinking and change your life. If you’re already an expert, this peep under the mental hood will give you ideas for: turbocharging successful learning, including counter-intuitive test-taking tips and insights that will help you make the best use of your time on homework and problem sets. If you’re struggling, you’ll see a structured treasure trove of practical techniques that walk you through what you need to do to get on track. If you’ve ever wanted to become better at anything, this course will help serve as your guide.\n\nThis course can be taken independent of, concurrent with, or prior to, its companion course, Mindshift. (Learning How to Learn is more learning focused, and Mindshift is more career focused.)\n\n To join the fully translated Portuguese version of the course, visit: https:\/\/www.coursera.org\/learn\/aprender\n To join the fully translated Spanish version of the course, visit: https:\/\/www.coursera.org\/learn\/aprendiendo-a-aprender\n To join the fully translated Chinese version of the course, visit: https:\/\/www.coursera.org\/learn\/ruhe-xuexi","difficulty_level":"","duration":"Approx. 12 hours to complete","keywords":"Test Preparation, Learning To Learn, Pomodoro Technique, Meta Learning, ","url":"https:\/\/www.coursera.org\/learn\/learning-how-to-learn"},{"title":"Successful Negotiation: Essential Strategies and Skills","description":"We all negotiate on a daily basis. On a personal level, we negotiate with friends, family, landlords, car sellers and employers, among others. Negotiation is also the key to business success. No business can survive without profitable contracts. Within a company, negotiation skills can lead to your career advancement. \n\nI hope that you will join the hundreds of thousands of learners who have made “Successful Negotiation” one of the most popular and highly-rated MOOCs worldwide.  In the course, you’ll learn about and practice the four steps to a successful negotiation: \n\n   (1) Prepare: Plan Your Negotiation Strategy \n\n   (2) Negotiate: Use Key Tactics for Success \n\n   (3) Close: Create a Contract \n\n   (4) Perform and Evaluate: The End Game \n\nTo successfully complete this course and improve your ability to negotiate, you’ll need to do the following: \n\n(1) Watch the short videos (ranging from 5 to 20 minutes). The videos are interactive and they include questions to test your understanding of negotiation strategy and skills. You can speed up or slow down videos to match your preferred pace for listening. Depending on your schedule, you can watch the videos over a few weeks or you can binge watch them. A learner who binge-watched the course concluded that “It’s as good as Breaking Bad.” Another learner compared the course to “House of Cards.”  Both shows contain interesting examples of complex negotiations!\n\n(2) Test your negotiation skills by completing the negotiation in Module 6. You can negotiate with a local friend or use Discussions to find a partner from another part of the world. Your negotiation partner will give you feedback on your negotiation skills. To assist you with your negotiations, I have developed several free negotiating planning tools that are related to the course.  These tools and a free app are available at http:\/\/negotiationplanner.com\/ \n\n(3) Take the final exam. To successfully complete the course, you must answer 80% of the questions correctly. The exam is a Mastery Exam, which means that you can take it as many times as you want until you master the material. \n\nCourse Certificate\nYou have the option of earning a Course Certificate.  A Certificate provides formal recognition of your achievements in the course and includes the University of Michigan logo.   Learn more about Certificates at: https:\/\/learner.coursera.help\/hc\/en-us\/articles\/209819053-Get-a-Course-Certificate\n \nThis course is also available in Spanish and Portuguese. To join the fully translated Spanish version, visit this page: https:\/\/www.coursera.org\/learn\/negociacion\/ \n\nTo join the fully translated Portuguese version, visit this page: https:\/\/www.coursera.org\/learn\/negociacao\nSubtitles for the videos are available in English, Ukrainian, Chinese (Simplified), Portuguese (Brazilian), Spanish\n\n\nCreated by:  University of Michigan\n\nThe course logo composite is shared with a Creative Commons CC BY-SA (https:\/\/creativecommons.org\/licenses\/by-sa\/2.0\/) license, and was created using images provided courtesy of Flazingo Photos (http:\/\/bit.ly\/1zOylRm) and K2 Space (https:\/\/www.flickr.com\/photos\/k2space\/14257556613\/in\/set-72157644732478432).","difficulty_level":"","duration":"Approx. 15 hours to complete","keywords":"Strategic Negotiations, Communication, Negotiation, Decision Tree, ","url":"https:\/\/www.coursera.org\/learn\/negotiation-skills"},{"title":"Private Equity and Venture Capital","description":"The course deals with the analysis of the private equity and venture capital business. \nOver the course, students will be provided with a deep understanding of the mechanism underpinning the creation and\/or development of a firm and the financial support it can get from the financial system through venture capital investment.\n\nThe course tries to discover how special financial intermediaries (called private equity investors) finance through equity companies belonging to different stages of their life-cycle, starting from the very beginning (startup and early stage) to a more mature phase (i.e. expansion, mature age, etc.) or also staying into crises and decline. \n\nPrivate equity (named venture capital when the company is in the first phases of its life cycle) deals with very different activities, such as scouting, advisory, deal-making, valuation, and financing as financial intermediaries see it. \n\nCOURSE SYLLABUS\nThe course is made up of four different modules: \nWEEK 1 - Introduction to Private Equity and Venture Capital\nWEEK 2 - Discovering Private Equity Investors: Legal Issues and Taxation\nWEEK 3 - Management of Private Equity and Venture Capital Funds\nWEEK 4 - Company Valuation And Deal Making In Private Equity Settings\nWEEK 5 - Final Test\nThroughout the course, guest speakers and practitioners will be interviewed to provide some examples of concrete applications of the contents presented.\n\nRECOMMENDED BACKGROUND\nAn understanding of the basic concepts of corporate financing accounting principles is required, while prior knowledge of private equity and venture capital is not required however it is recommended, as this is a course designed to introduce you to the fundamental concepts in private equity and venture capital.","difficulty_level":"","duration":"Approx. 12 hours to complete","keywords":"Valuation (Finance), Venture Capital, Venture Capital Financing, Private Equity, ","url":"https:\/\/www.coursera.org\/learn\/private-equity"},{"title":"Indigenous Canada","description":"Indigenous Canada is a 12-lesson Massive Open Online Course (MOOC) that explores Indigenous histories and contemporary issues in Canada. From an Indigenous perspective, this course explores key issues facing Indigenous peoples today from a historical and critical perspective highlighting national and local Indigenous-settler relations. Topics for the 12 lessons include the fur trade and other exchange relationships, land claims and environmental impacts, legal systems and rights, political conflicts and alliances, Indigenous political activism, and contemporary Indigenous life, art and its expressions.","difficulty_level":"","duration":"Approx. 20 hours to complete","keywords":"Art History, Art, History, Mythology, ","url":"https:\/\/www.coursera.org\/learn\/indigenous-canada"},{"title":"The Data Scientist’s Toolbox","description":"In this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.","difficulty_level":"","duration":"Approx. 8 hours to complete","keywords":"Data Science, Github, R Programming, Rstudio, ","url":"https:\/\/www.coursera.org\/learn\/data-scientists-tools"},{"title":"Neural Networks and Deep Learning","description":"If you want to break into cutting-edge AI, this course will help you do so. Deep learning engineers are highly sought after, and mastering deep learning will give you numerous new career opportunities. Deep learning is also a new \"superpower\" that will let you build AI systems that just weren't possible a few years ago. \n\nIn this course, you will learn the foundations of deep learning. When you finish this class, you will:\n- Understand the major technology trends driving Deep Learning\n- Be able to build, train and apply fully connected deep neural networks \n- Know how to implement efficient (vectorized) neural networks \n- Understand the key parameters in a neural network's architecture \n\nThis course also teaches you how Deep Learning actually works, rather than presenting only a cursory or surface-level description. So after completing it, you will be able to apply deep learning to a your own applications. If you are looking for a job in AI, after this course you will also be able to answer basic interview questions. \n\nThis is the first course of the Deep Learning Specialization.","difficulty_level":"Intermediate Level","duration":"Approx. 18 hours to complete","keywords":"Artificial Neural Network, Backpropagation, Python Programming, Deep Learning, ","url":"https:\/\/www.coursera.org\/learn\/neural-networks-deep-learning"},{"title":"Google Cloud Platform Fundamentals: Core Infrastructure","description":"This course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL, and BigQuery. You learn about important resource and policy management tools, such as the Google Cloud Resource Manager hierarchy and Google Cloud Identity and Access Management. Hands-on labs give you foundational skills for working with GCP.\n\nNote:\n•Google services are currently unavailable in China.\n\nCOMPLETION CHALLENGE\nComplete any GCP specialization from November 5 - November 30, 2019 for an opportunity to receive a GCP t-shirt (while supplies last). Check Discussion Forums for details.","difficulty_level":"Intermediate Level","duration":"Approx. 13 hours to complete","keywords":"Google Compute Engine, Google App Engine (GAE), Google Cloud Platform, Cloud Computing, ","url":"https:\/\/www.coursera.org\/learn\/gcp-fundamentals"},{"title":"Introduction to Data Science in Python","description":"This course will introduce the learner to the basics of the python programming environment, including fundamental python programming techniques such as lambdas, reading and manipulating csv files, and the numpy library. The course will introduce data manipulation and cleaning techniques using the popular python pandas data science library and introduce the abstraction of the Series and DataFrame as the central data structures for data analysis, along with tutorials on how to use functions such as groupby, merge, and pivot tables effectively. By the end of this course, students will be able to take tabular data, clean it, manipulate it, and run basic inferential statistical analyses. \n\nThis course should be taken before any of the other Applied Data Science with Python courses: Applied Plotting, Charting & Data Representation in Python, Applied Machine Learning in Python, Applied Text Mining in Python, Applied Social Network Analysis in Python.","difficulty_level":"Intermediate Level","duration":"Approx. 18 hours to complete","keywords":"Python Programming, Numpy, Pandas, Data Cleansing, ","url":"https:\/\/www.coursera.org\/learn\/python-data-analysis"},{"title":"Introduction to TensorFlow for Artificial Intelligence, Machine Learning, and Deep Learning","description":"If you are a software developer who wants to build scalable AI-powered algorithms, you need to understand how to use the tools to build them. This course is part of the upcoming Machine Learning in Tensorflow Specialization and will teach you best practices for using TensorFlow, a popular open-source framework for machine learning. \n\nThe Machine Learning course and Deep Learning Specialization from Andrew Ng teach the most important and foundational principles of Machine Learning and Deep Learning. This new deeplearning.ai TensorFlow Specialization teaches you how to use TensorFlow to implement those principles so that you can start building and applying scalable models to real-world problems. To develop a deeper understanding of how neural networks work, we recommend that you take the Deep Learning Specialization.","difficulty_level":"Intermediate Level","duration":"Approx. 9 hours to complete","keywords":"Computer Vision, Tensorflow, Machine Learning, ","url":"https:\/\/www.coursera.org\/learn\/introduction-tensorflow"},{"title":"Convolutional Neural Networks","description":"This course will teach you how to build convolutional neural networks and apply it to image data. Thanks to deep learning, computer vision is working far better than just two years ago, and this is enabling numerous exciting applications ranging from safe autonomous driving, to accurate face recognition, to automatic reading of radiology images. \n\nYou will:\n- Understand how to build a convolutional neural network, including recent variations such as residual networks.\n- Know how to apply convolutional networks to visual detection and recognition tasks.\n- Know to use neural style transfer to generate art.\n- Be able to apply these algorithms to a variety of image, video, and other 2D or 3D data.\n\nThis is the fourth course of the Deep Learning Specialization.","difficulty_level":"Intermediate Level","duration":"Approx. 21 hours to complete","keywords":"Facial Recognition System, Tensorflow, Convolutional Neural Network, Artificial Neural Network, ","url":"https:\/\/www.coursera.org\/learn\/convolutional-neural-networks"},{"title":"Machine Learning with Python","description":"This course dives into the basics of machine learning using an approachable, and well-known programming language, Python. \nIn this course, we will be reviewing two main components:\nFirst, you will be learning about the purpose of Machine Learning and where it applies to the real world. \nSecond, you will get a general overview of Machine Learning topics such as supervised vs unsupervised learning,  model evaluation, and Machine Learning algorithms. \n\nIn this course, you practice with real-life examples of Machine learning and see how it affects society in ways you may not have guessed!\n\nBy just putting in a few hours a week for the next few weeks, this is what you’ll get.\n1) New skills to add to your resume, such as regression, classification, clustering, sci-kit learn and SciPy \n2) New projects that you can add to your portfolio, including cancer detection, predicting economic trends, predicting customer churn, recommendation engines, and many more.\n3) And a certificate in machine learning to prove your competency, and share it anywhere you like online or offline, such as LinkedIn profiles and social media.\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge upon successful completion of the course.","difficulty_level":"Intermediate Level","duration":"Approx. 17 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/machine-learning-with-python"},{"title":"Getting Started with Google Kubernetes Engine","description":"This one-week, accelerated online class equips students to containerize workloads in Docker containers, deploy them to Kubernetes clusters provided by Google Kubernetes Engine, and scale those workloads to handle increased traffic.  Students also learn how to continuously deploy new code in a Kubernetes cluster to provide application updates.\n\nAt the end of the course, you will be able to:\n• Understand container basics\n• Containerize an existing application\n• Understand Kubernetes concepts and principles\n• Deploy applications to Kubernetes using the CLI\n• Set up a continuous delivery pipeline using Jenkins\n• Locate more documentation and training.\n\nTo get the most of out of this course, learners should have basic proficiency with command-line tools and Linux operating system environments, as well as Web server technologies such as Nginx. We also recommend systems operations experience, including deploying and managing applications, either on-premises or in a public cloud environment.\n\n>>> By enrolling in this course you agree to the Qwiklabs Terms of Service as set out in the FAQ and located at: https:\/\/qwiklabs.com\/terms_of_service <<<","difficulty_level":"Intermediate Level","duration":"Approx. 7 hours to complete","keywords":"Continuous Delivery, Kubernetes, Google Cloud Platform, Jenkins (Software), ","url":"https:\/\/www.coursera.org\/learn\/google-kubernetes-engine"},{"title":"AWS Fundamentals: Migrating to the Cloud","description":"This four week course focuses on migrating workloads to AWS.  We will focus on  analyzing your current environment, planning your migration, AWS services that are commonly used during your migration, and the actual migration steps.  \n\nHands-on labs are available, though not required for this class.  Access to the labs is limited to paid enrolled students.  You can audit this  course without taking the labs.  As we dive into each of the services covered in this class, there will be links to documentation where you can find example applications and code samples.\n\nIf you are new to AWS, we strongly suggest that you take “AWS Fundamentals: Going Cloud Native” (https:\/\/www.coursera.org\/learn\/aws-fundamentals-going-cloud-native) course available on Coursera to provide an introduction to AWS concepts and services.","difficulty_level":"Intermediate Level","duration":"Approx. 12 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/aws-fundamentals-cloud-migration"},{"title":"Google Cloud Platform Big Data and Machine Learning Fundamentals","description":"This 2-week accelerated on-demand course introduces participants to the Big Data and Machine Learning capabilities of Google Cloud Platform (GCP). It provides a quick overview of the Google Cloud Platform and a deeper dive of the data processing capabilities.\n\nAt the end of this course, participants will be able to:\n• Identify the purpose and value of the key Big Data and Machine Learning products in the Google Cloud Platform\n• Use CloudSQL and Cloud Dataproc to migrate existing MySQL and Hadoop\/Pig\/Spark\/Hive workloads to Google Cloud Platform\n• Employ BigQuery and Cloud Datalab to carry out interactive data analysis\n• Choose between Cloud SQL, BigTable and Datastore\n• Train and use a neural network using TensorFlow\n• Choose between different data processing products on the Google Cloud Platform\n\nBefore enrolling in this course, participants should have roughly one (1) year of experience with one or more of the following:\n• A common query language such as SQL\n• Extract, transform, load activities\n• Data modeling\n• Machine learning and\/or statistics\n• Programming in Python\n\nGoogle Account Notes:\n• Google services are currently unavailable in China.\n\nCOMPLETION CHALLENGE\nComplete any GCP specialization from November 5 - November 30, 2019 for an opportunity to receive a GCP t-shirt (while supplies last). Check Discussion Forums for details.","difficulty_level":"Intermediate Level","duration":"Approx. 13 hours to complete","keywords":"Tensorflow, Bigquery, Google Cloud Platform, Cloud Computing, ","url":"https:\/\/www.coursera.org\/learn\/gcp-big-data-ml-fundamentals"},{"title":"Getting Started with AWS Machine Learning","description":"Machine learning (ML) is one of the fastest growing areas in technology and a highly sought after skillset in today’s job market. The World Economic Forum states the growth of artificial intelligence (AI) could create 58 million net new jobs in the next few years, yet it’s estimated that currently there are 300,000 AI engineers worldwide, but millions are needed. This means there is a unique and immediate opportunity for you to get started with learning the essential ML concepts that are used to build AI applications – no matter what your skill levels are. Learning the foundations of ML now, will help you keep pace with this growth, expand your skills and even help advance your career. \n\nThis course will teach you how to get started with AWS Machine Learning. Key topics include: Machine Learning on AWS, Computer Vision on AWS, and Natural Language Processing (NLP) on AWS. Each topic consists of several modules deep-diving into variety of ML concepts, AWS services as well as insights from experts to put the concepts into practice.","difficulty_level":"Intermediate Level","duration":"Approx. 10 hours to complete","keywords":"Artificial Intelligence (AI), Machine Learning, Amazon SageMaker, Natural Language Processing (NLP), Computer Vision, ","url":"https:\/\/www.coursera.org\/learn\/aws-machine-learning"},{"title":"Site Reliability Engineering: Measuring and Managing Reliability","description":"This course teaches the theory of Service Level Objectives (SLOs), a principled way of describing and measuring the desired reliability of a service. Upon completion, learners should be able to apply these principles to develop the first SLOs for services they are familiar with in their own organizations.\n\nLearners will also learn how to use Service Level Indicators (SLIs) to quantify reliability and Error Budgets to drive business decisions around engineering for greater reliability.  The learner will  understand the components of a meaningful SLI and walk through the process of developing SLIs and SLOs for an example service.","difficulty_level":"Advanced Level","duration":"Approx. 23 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/site-reliability-engineering-slos"},{"title":"Medical Neuroscience","description":"Medical Neuroscience explores the functional organization and neurophysiology of the human central nervous system, while providing a neurobiological framework for understanding human behavior. In this course, you will discover the organization of the neural systems in the brain and spinal cord that mediate sensation, motivate bodily action, and integrate sensorimotor signals with memory, emotion and related faculties of cognition. The overall goal of this course is to provide the foundation for understanding the impairments of sensation, action and cognition that accompany injury, disease or dysfunction in the central nervous system. The course will build upon knowledge acquired through prior studies of cell and molecular biology, general physiology and human anatomy, as we focus primarily on the central nervous system.\n\nThis online course is designed to include all of the core concepts in neurophysiology and clinical neuroanatomy that would be presented in most first-year neuroscience courses in schools of medicine. However, there are some topics (e.g., biological psychiatry) and several learning experiences (e.g., hands-on brain dissection) that we provide in the corresponding course offered in the Duke University School of Medicine on campus that we are not attempting to reproduce in Medical Neuroscience online. Nevertheless, our aim is to faithfully present in scope and rigor a medical school caliber course experience.\n\nThis course comprises six units of content organized into 12 weeks, with an additional week for a comprehensive final exam:\n- Unit 1 Neuroanatomy (weeks 1-2). This unit covers the surface anatomy of the human brain, its internal structure, and the overall organization of sensory and motor systems in the brainstem and spinal cord.\n- Unit 2 Neural signaling (weeks 3-4). This unit addresses the fundamental mechanisms of neuronal excitability, signal generation and propagation, synaptic transmission, post synaptic mechanisms of signal integration, and neural plasticity.\n- Unit 3 Sensory systems (weeks 5-7). Here, you will learn the overall organization and function of the sensory systems that contribute to our sense of self relative to the world around us: somatic sensory systems, proprioception, vision, audition, and balance senses.\n- Unit 4 Motor systems (weeks 8-9). In this unit, we will examine the organization and function of the brain and spinal mechanisms that govern bodily movement.\n- Unit 5 Brain Development (week 10). Next, we turn our attention to the neurobiological mechanisms for building the nervous system in embryonic development and in early postnatal life; we will also consider how the brain changes across the lifespan.\n- Unit 6 Cognition (weeks 11-12). The course concludes with a survey of the association systems of the cerebral hemispheres, with an emphasis on cortical networks that integrate perception, memory and emotion in organizing behavior and planning for the future; we will also consider brain systems for maintaining homeostasis and regulating brain state.","difficulty_level":"Advanced Level","duration":"Approx. 95 hours to complete","keywords":"Brain, Neurological Disorders, Neurobiology, Neurology, ","url":"https:\/\/www.coursera.org\/learn\/medical-neuroscience"},{"title":"Preparing for the Google Cloud Professional Cloud Architect Exam","description":"From the course: \"The best way to prepare for the exam is to be competent in the skills required of the job.\"\n\nThis course uses a top-down approach to recognize knowledge and skills already known, and to surface information and skill areas for additional preparation. You can use this course to help create your own custom preparation plan. It helps you distinguish what you know from what you don't know. And it helps you develop and practice skills required of practitioners who perform this job.\n\nThe course follows the organization of the Exam Guide outline, presenting highest-level concepts, \"touchstones\", for you to determine whether you feel confident about your knowledge of that area and its dependent concepts, or if you want more study. You also will learn about and have the opportunity to practice key job skills, including cognitive skills such as case analysis, identifying technical watchpoints, and developing proposed solutions. These are job skills that are also exam skills. You will also test your basic abilities with Activity Tracking Challenge Labs. And you will have many sample questions similar to those on the exam, including solutions. The end of the course contains an ungraded practice exam quiz, followed by a graded practice exam quiz that simulates the exam-taking experience.","difficulty_level":"Advanced Level","duration":"Approx. 15 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/preparing-cloud-professional-cloud-architect-exam"},{"title":"Advanced Valuation and Strategy - M&A, Private Equity, and Venture Capital","description":"Hi and welcome to this course! \n\nWould you like to learn about the latest valuation methods that may help you to make better business decisions? Then 'Advanced Valuation and Strategy – M&A, Private Equity, and Venture Capital' by Erasmus University Rotterdam is the right course for you! This course is helpful for executives that need to value complete strategies and for all students interested in corporate finance and strategy. We present the latest tools and show you how to apply them!\n\nWe will revolutionize your way of decision making, by extending static techniques from corporate finance with dynamic methods to quantify strategic thinking. Traditionally, we assess the attractiveness of an investment as a mature business, where future cash flows mainly result from past decisions. But, in an ever-changing world, strategic decisions determine the firm’s long-term success and market value. Yet managers often have to consider these long-term implications using intuition and experience alone, with little guidance from structured, quantitative analysis.\n\nOur treatment goes far beyond the use of standard valuation analysis. We introduce the expanded NPV, which brings together DCF, real options, and game theory. Thinking in terms of options, games, and adaptive strategies may help managers address strategic questions such as: How do you value a leveraged buyout? How can you value a high-tech venture with negative cash flows? When should you invest in new ventures in stages? How can you incorporate rival bidders in the analysis?\n\nThe tools we provide can improve your decisions in business and in daily life.\n\n* Who is this class for?\nWe hope that our course appeals to (graduate) students in finance, economics, and business, as well as to high-ranking professionals and a general audience. This course is particularly interesting for venture capitalists, private equity investors, investment bankers, CEOs, CFOs, and those who aspire these affiliations. We offer this MOOC at 3 levels:\n\n1.Executive Summary: \nThis 1-week module provides critical insights into the principles of corporate valuation and strategy. This is accessible for time-constrained executives and the general audience without any prior knowledge.\n\n2. Student Level:\nThis level involves an understanding of the technical details.  This level requires basic knowledge of concepts in corporate finance, e.g., the time value of money, financial statement analysis, capital structure, and the relation between risk and returns. Learners of this level can skip week 1.\n\n3. Honors Level (honors certificate): \nThis level is challenging, engaging, and compelling to an intellectually rigorous student.","difficulty_level":"Advanced Level","duration":"Approx. 26 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/advanced-valuation-and-strategy"},{"title":"Probabilistic Graphical Models 1: Representation","description":"Probabilistic graphical models (PGMs) are a rich framework for encoding probability distributions over complex domains: joint (multivariate) distributions over large numbers of random variables that interact with each other. These representations sit at the intersection of statistics and computer science, relying on concepts from probability theory, graph algorithms, machine learning, and more. They are the basis for the state-of-the-art methods in a wide variety of applications, such as medical diagnosis, image understanding, speech recognition, natural language processing, and many, many more. They are also a foundational tool in formulating many machine learning problems. \n\nThis course is the first in a sequence of three. It describes the two basic PGM representations: Bayesian Networks, which rely on a directed graph; and Markov networks, which use an undirected graph. The course discusses both the theoretical properties of these representations as well as their use in practice. The (highly recommended) honors track contains several hands-on assignments on how to represent some real-world problems. The course also presents some important extensions beyond the basic PGM representation, which allow more complex models to be encoded compactly.","difficulty_level":"Advanced Level","duration":"Approx. 30 hours to complete","keywords":"Bayesian Network, Graphical Model, Markov Random Field, ","url":"https:\/\/www.coursera.org\/learn\/probabilistic-graphical-models"},{"title":"Introduction to Self-Driving Cars","description":"Welcome to Introduction to Self-Driving Cars, the first course in University of Toronto’s Self-Driving Cars Specialization. \n\nThis course will introduce you to the terminology, design considerations and safety assessment of self-driving cars.  By the end of this course, you will be able to: \n- Understand commonly used hardware used for self-driving cars\n- Identify the main components of the self-driving software stack\n- Program vehicle modelling and control  \n- Analyze the safety frameworks and current industry practices for vehicle development\n\nFor the final project in this course, you will develop control code to navigate a self-driving car around a racetrack in the CARLA simulation environment. You will construct longitudinal and lateral dynamic models for a vehicle and create controllers that regulate speed and path tracking performance using Python. You’ll test the limits of your control design and learn the challenges inherent in driving at the limit of vehicle performance.\n\nThis is an advanced course, intended for learners with a background in mechanical engineering, computer and electrical engineering, or robotics. To succeed in this course, you should have programming experience in Python 3.0, familiarity with Linear Algebra (matrices, vectors, matrix multiplication, rank, Eigenvalues and vectors and inverses), Statistics (Gaussian probability distributions), Calculus and Physics (forces, moments, inertia, Newton's Laws).\n\nYou will also need certain hardware and software specifications in order to effectively run the CARLA simulator: Windows 7 64-bit (or later) or Ubuntu 16.04 (or later), Quad-core Intel or AMD processor (2.5 GHz or faster), NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card or higher, 8 GB RAM, and OpenGL 3 or greater (for Linux computers).","difficulty_level":"Advanced Level","duration":"Approx. 26 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/intro-self-driving-cars"},{"title":"Introduction to Deep Learning","description":"The goal of this course is to give learners basic understanding of modern neural networks and their applications in computer vision and natural language understanding. The course starts with a recap of linear models and discussion of stochastic optimization methods that are crucial for training deep neural networks. Learners will study all popular building blocks of neural networks including fully connected layers, convolutional and recurrent layers. \nLearners will use these building blocks to define complex modern architectures in TensorFlow and Keras frameworks. In the course project learner will implement deep neural network for the task of image captioning which solves the problem of giving a text description for an input image.\n\nThe prerequisites for this course are: \n1) Basic knowledge of Python.\n2) Basic linear algebra and probability.\n\nPlease note that this is an advanced course and we assume basic knowledge of machine learning. You should understand:\n1) Linear regression: mean squared error, analytical solution.\n2) Logistic regression: model, cross-entropy loss, class probability estimation.\n3) Gradient descent for linear models. Derivatives of MSE and cross-entropy loss functions.\n4) The problem of overfitting.\n5) Regularization for linear models.\n\nDo you have technical problems? Write to us: coursera@hse.ru","difficulty_level":"Advanced Level","duration":"Approx. 35 hours to complete","keywords":"Recurrent Neural Network, Tensorflow, Convolutional Neural Network, Deep Learning, ","url":"https:\/\/www.coursera.org\/learn\/intro-to-deep-learning"},{"title":"How to Win a Data Science Competition: Learn from Top Kagglers","description":"If you want to break into competitive data science, then this course is for you! Participating in predictive modelling competitions can help you gain practical experience, improve and harness your data modelling skills in various domains such as credit, insurance, marketing, natural language processing, sales’ forecasting and computer vision to name a few. At the same time you get to do it in a competitive context against thousands of participants where each one tries to build the most predictive algorithm. Pushing each other to the limit can result in better performance and smaller prediction errors. Being able to achieve high ranks consistently can help you accelerate your career in data science.\n\nIn this course, you will learn to analyse and solve competitively such predictive modelling tasks. \n\nWhen you finish this class, you will:\n\n- Understand how to solve predictive modelling competitions efficiently and learn which of the skills obtained can be applicable to real-world tasks.\n- Learn how to preprocess the data and generate new features from various sources such as text and images.\n- Be taught advanced feature engineering techniques like generating mean-encodings, using aggregated statistical measures or finding nearest neighbors as a means to improve your predictions.\n- Be able to form reliable cross validation methodologies that help you benchmark your solutions and avoid overfitting or underfitting when tested with unobserved (test) data. \n- Gain experience of analysing and interpreting the data. You will become aware of inconsistencies, high noise levels, errors and other data-related issues such as leakages and you will learn how to overcome them. \n- Acquire knowledge of different algorithms and learn how to efficiently tune their hyperparameters and achieve top performance. \n- Master the art of combining different machine learning models and learn how to ensemble. \n- Get exposed to past (winning) solutions and codes and learn how to read them.\n\nDisclaimer : This is not a machine learning course in the general sense. This course will teach you how to get high-rank solutions against thousands of competitors with focus on practical usage of machine learning methods rather than the theoretical underpinnings behind them.\n\nPrerequisites: \n- Python: work with DataFrames in pandas, plot figures in matplotlib, import and train models from scikit-learn, XGBoost, LightGBM.\n- Machine Learning: basic understanding of linear models, K-NN, random forest, gradient boosting and neural networks.\n\nDo you have technical problems? Write to us: coursera@hse.ru","difficulty_level":"Advanced Level","duration":"Approx. 48 hours to complete","keywords":"Data Analysis, Feature Extraction, Feature Engineering, Xgboost, ","url":"https:\/\/www.coursera.org\/learn\/competitive-data-science"},{"title":"End-to-End Machine Learning with TensorFlow on GCP","description":"In the first course of this specialization, we will recap what was covered in the  Machine Learning with TensorFlow on Google Cloud Platform Specialization (https:\/\/www.coursera.org\/specializations\/machine-learning-tensorflow-gcp).\n\nOne of the best ways to review something is to work with the concepts and technologies that you have learned.\n\nSo, this course is set up as a workshop and in this workshop, you will do End-to-End Machine Learning with TensorFlow on Google Cloud Platform\n\nPrerequisites:\nBasic SQL, familiarity with Python and TensorFlow\n\n>>> By enrolling in this course you agree to the Qwiklabs Terms of Service as set out in the FAQ and located at: https:\/\/qwiklabs.com\/terms_of_service <<<\n\nCOMPLETION CHALLENGE\nComplete any GCP specialization from November 5 - November 30, 2019 for an opportunity to receive a GCP t-shirt (while supplies last). Check Discussion Forums for details.","difficulty_level":"Advanced Level","duration":"Approx. 11 hours to complete","keywords":"","url":"https:\/\/www.coursera.org\/learn\/end-to-end-ml-tensorflow-gcp"},{"title":"Social and Economic Networks:  Models and Analysis","description":"Learn how to model social and economic networks and their impact on human behavior.  How do networks form, why do they exhibit certain patterns, and how does their structure impact diffusion, learning, and other behaviors?   We will bring together models and techniques from economics, sociology, math, physics, statistics and computer science to answer these questions.\n\nThe course begins with some empirical background on social and economic networks, and an overview of concepts used to describe and measure networks. Next, we will cover a set of models of how networks form, including random network models as well as strategic formation models, and some hybrids. We will then discuss a series of models of how networks impact behavior, including contagion, diffusion, learning, and peer influences.\n\nYou can find a more detailed syllabus here:  http:\/\/web.stanford.edu\/~jacksonm\/Networks-Online-Syllabus.pdf \n\nYou can find a short introductory videao here: http:\/\/web.stanford.edu\/~jacksonm\/Intro_Networks.mp4","difficulty_level":"Advanced Level","duration":"Approx. 25 hours to complete","keywords":"Social Network, Game Theory, Network Analysis, Network Theory, ","url":"https:\/\/www.coursera.org\/learn\/social-economic-networks"}]